{
    "posts": [
        {
            "Customer Activity": "Activation",
            "Related Controls": "Not Applicable",
            "Customer Responsibility": "AWS customers can start using the Amazon ECR service via AWS Management Console or Command Line Interface (CLI). Customers must also create an IAM user so that the service can determine whether you have permission to access its resources. \r\n\r\nPlease refer to https://docs.aws.amazon.com/AmazonECR/latest/userguide/get-set-up-for-amazon-ecr.html for more information regarding activation.",
            "Supporting Service/Feature": "",
            "Additional Controls for Customer Consideration": ""
            
        },
        {
            "Customer Activity": "Control Interface",
            "Related Controls": "AC-02",
            "Customer Responsibility": "Customers can access Amazon ECR via AWS Management Console, Command Line Interface (CLI), AWS CDK, Amazon ECR API's.  Access to Amazon ECR requires IAM credentials. Those credentials must have permission to access AWS resources, such as an Container Registry resources.\r\n\r\nECR can also be accessed using Docker client or any other OCI client once the user gets an authentication token using the ECR API. For more information, refer to https://docs.aws.amazon.com/AmazonECR/latest/userguide/docker-pull-ecr-image.html and https://docs.aws.amazon.com/AmazonECR/latest/userguide/docker-push-ecr-image.html",
            "Supporting Service/Feature": "",
            "Additional Controls for Customer Consideration": "IA-03\r\nSC-23"
            
        },
        {
            "Customer Activity": "Data Flow Enforcement",
            "Related Controls": "AC-04",
            "Customer Responsibility": "The AWS shared responsibility model applies to data protection in Amazon ECR. As described in this model, AWS is responsible for protecting the global infrastructure that runs all of the AWS Cloud. You are responsible for maintaining control over your content hosted on this infrastructure, including performing the security configuration and management tasks for the AWS services you use. For information about data privacy, see Data Privacy FAQ.\r\n\r\nAWS strongly recommends that you never put sensitive identifying information, such as your customers' account numbers, into free-form fields such as a Name field. This includes when you work with Amazon ECR or other AWS services using the console, API, AWS CLI, or AWS SDKs. Any data that you enter into Amazon ECR or other services might get picked up for inclusion in diagnostic logs. When you provide a URL to an external server, don't include credentials information in the URL to validate your request to that server.",
            "Supporting Service/Feature": "",
            "Additional Controls for Customer Consideration": "AC-04 (05)\r\nAC-04 (08)\r\nAC-04 (10)\r\nAC-04 (12)\r\nAC-04 (14)\r\nAC-16"
            
        },
        {
            "Customer Activity": "Configuration Baselines and Software",
            "Related Controls": "CM-02\r\nCM-02 (01)\r\nCM-02 (02)\r\nCM-02 (03)\r\nCM-02 (07)",
            "Customer Responsibility": "Amazon ECR customers are responsible for establishing security and configuration baselines for Amazon ECR image configurations within their ability to control and in accordance with their organizational requirements. ",
            "Supporting Service/Feature": "Amazon ECR - Image Scanning",
            "Additional Controls for Customer Consideration": "AC-06 (08)\r\nAT-03 (03)\r\nCM-06\r\nCM-07 (05)\r\nCM-11\r\nMA-03\r\nMA-03 (01)\r\nSI-07"
            
        },
        {
            "Customer Activity": "Operating System/ Container Images",
            "Related Controls": "CM-03\r\nCM-06",
            "Customer Responsibility": "AWS prohibits customers from accessing or configuring the operating systems of underlying compute instances. Amazon ECR customers are responsible for managing the containers that are stored/deployed via ECR. Customers can enable Lifecycle policies to manage the lifecycle of the images in your repositories. Customers can define rules which result in the removal of unused images which can be tested before applying to their repository.  ",
            "Supporting Service/Feature": "Amazon ECR - Lifecycle Policies",
            "Additional Controls for Customer Consideration": "AC-06 (05)\r\nAC-07\r\nAC-11\r\nCM-02\r\nCM-03 (02)\r\nCM-04\r\nCM-05\r\nSA-11\r\n"
            
        },
        {
            "Customer Activity": "Inventory",
            "Related Controls": "CM-03\r\nCM-08",
            "Customer Responsibility": "Amazon ECR customers can gain visibility of the images that are stored within ECR Repositories. Customers have the ability to tag the images to categorize resources. Customers are responsible for maintaining and documenting inventory of ECR images if applicable to their organizational requirements. ",
            "Supporting Service/Feature": "",
            "Additional Controls for Customer Consideration": "SA-12"
            
        }
    ],
    "comments": [
        {
            "id": 1,
            "body": "some comment",
            "postId": 1
        }
    ],
    "profile": {
        "name": "typicode"
    }
}